作業目標:<br>
1. 運用編碼處理類別資料<br>
2. 補缺失值

作業重點: <br>
1. 類別編碼有多種方法，需分辨使用方法與時機<br>
2. 補缺失值須因應情境決定如何補值

題目 : 
將以下問卷資料的職業(Profession)欄位缺失值填入字串'others'，更進一步將字串做編碼。
此時用什麼方式做編碼比較適合?為什麼?

import pandas as pd <br>
q_df = pd.DataFrame([['male', 'teacher'], 
              ['male', 'engineer'],
              ['female', None],
              ['female', 'engineer']],columns=['Sex','Profession'])

In [1]:
import pandas as pd
q_df = pd.DataFrame([['male', 'teacher'], 
              ['male', 'engineer'],
              ['female', None],
              ['female', 'engineer']],columns=['Sex','Profession'])
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female       None
3  female   engineer

In [3]:
#缺失值填入字串'others'
q_df.Profession = q_df.Profession.fillna('others')
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female     others
3  female   engineer

In [9]:
#更進一步將字串做編碼。 此時用什麼方式做編碼比較適合?為什麼?
Sex = pd.DataFrame([int(x == 'male') for x in q_df.Sex], columns=['Sex']) #因為sex只有male跟female兩種，故0,1即可表示
Profession = pd.get_dummies(q_df.Profession) #Profession沒有順序問題，故get_dummies即可
df = pd.concat([Sex, Profession], axis=1)
df

   Sex  engineer  others  teacher
0    1         0       0        1
1    1         1       0        0
2    0         0       1        0
3    0         1       0        0